"{\"class_name\": \"Tokenizer\", \"config\": {\"num_words\": 10000, \"filters\": \"!\\\"#$%&()*+,-./:;<=>?@[\\\\]^_`{|}~\\t\\n\", \"lower\": true, \"split\": \" \", \"char_level\": false, \"oov_token\": null, \"document_count\": 3094, \"word_counts\": \"{\\\"how\\\": 1326, \\\"does\\\": 884, \\\"jesse\\\": 2210, \\\"test\\\": 2652, \\\"backtesting\\\": 21, \\\"one\\\": 28, \\\"route\\\": 63, \\\"what\\\": 884, \\\"the\\\": 2259, \\\"verify\\\": 442, \\\"in\\\": 2827, \\\"can\\\": 533, \\\"you\\\": 442, \\\"explain\\\": 442, \\\"functionality\\\": 442, \\\"assertions\\\": 442, \\\"are\\\": 477, \\\"used\\\": 442, \\\"is\\\": 624, \\\"implemented\\\": 449, \\\"jesse's\\\": 442, \\\"suite\\\": 442, \\\"what's\\\": 442, \\\"purpose\\\": 442, \\\"of\\\": 470, \\\"show\\\": 442, \\\"me\\\": 442, \\\"to\\\": 687, \\\"three\\\": 7, \\\"routes\\\": 28, \\\"cancel\\\": 28, \\\"all\\\": 7, \\\"orders\\\": 154, \\\"opening\\\": 56, \\\"and\\\": 126, \\\"closing\\\": 21, \\\"position\\\": 301, \\\"with\\\": 98, \\\"stop\\\": 133, \\\"loss\\\": 112, \\\"should\\\": 84, \\\"not\\\": 28, \\\"submit\\\": 42, \\\"reduce\\\": 42, \\\"only\\\": 21, \\\"when\\\": 7, \\\"closed\\\": 7, \\\"candle\\\": 70, \\\"includes\\\": 14, \\\"price\\\": 98, \\\"generate\\\": 14, \\\"from\\\": 7, \\\"minutes\\\": 14, \\\"bearish\\\": 7, \\\"bullish\\\": 7, \\\"split\\\": 7, \\\"dict\\\": 7, \\\"np\\\": 21, \\\"array\\\": 21, \\\"completed\\\": 21, \\\"trade\\\": 42, \\\"a\\\": 70, \\\"simple\\\": 7, \\\"strategy\\\": 63, \\\"two\\\": 14, \\\"trades\\\": 42, \\\"after\\\": 98, \\\"exiting\\\": 7, \\\"qty\\\": 70, \\\"entry\\\": 84, \\\"exit\\\": 14, \\\"size\\\": 84, \\\"properties\\\": 21, \\\"handle\\\": 7, \\\"multiple\\\": 42, \\\"too\\\": 14, \\\"close\\\": 35, \\\"each\\\": 7, \\\"other\\\": 7, \\\"conflicting\\\": 14, \\\"2\\\": 14, \\\"append\\\": 7, \\\"flush\\\": 7, \\\"get\\\": 91, \\\"last\\\": 7, \\\"item\\\": 21, \\\"past\\\": 14, \\\"increases\\\": 7, \\\"drop\\\": 7, \\\"at\\\": 42, \\\"negative\\\": 7, \\\"balance\\\": 42, \\\"validation\\\": 14, \\\"for\\\": 77, \\\"futures\\\": 35, \\\"market\\\": 56, \\\"wallet\\\": 7, \\\"available\\\": 21, \\\"margin\\\": 14, \\\"app\\\": 28, \\\"currency\\\": 14, \\\"mode\\\": 56, \\\"arrow\\\": 14, \\\"timestamp\\\": 63, \\\"base\\\": 7, \\\"asset\\\": 14, \\\"binary\\\": 7, \\\"search\\\": 14, \\\"clean\\\": 7, \\\"orderbook\\\": 28, \\\"list\\\": 28, \\\"color\\\": 7, \\\"convert\\\": 14, \\\"number\\\": 7, \\\"dashless\\\": 7, \\\"symbol\\\": 14, \\\"dashy\\\": 7, \\\"date\\\": 21, \\\"diff\\\": 7, \\\"days\\\": 7, \\\"dna\\\": 21, \\\"hp\\\": 7, \\\"dump\\\": 7, \\\"exception\\\": 49, \\\"estimate\\\": 28, \\\"average\\\": 42, \\\"pnl\\\": 28, \\\"percentage\\\": 14, \\\"file\\\": 7, \\\"exists\\\": 7, \\\"floor\\\": 7, \\\"precision\\\": 7, \\\"format\\\": 14, \\\"unique\\\": 14, \\\"id\\\": 14, \\\"source\\\": 7, \\\"config\\\": 7, \\\"class\\\": 28, \\\"insecure\\\": 7, \\\"hash\\\": 14, \\\"insert\\\": 7, \\\"debuggable\\\": 7, \\\"debugging\\\": 7, \\\"importing\\\": 7, \\\"candles\\\": 77, \\\"live\\\": 21, \\\"livetrading\\\": 7, \\\"optimizing\\\": 7, \\\"paper\\\": 7, \\\"trading\\\": 7, \\\"unit\\\": 7, \\\"testing\\\": 7, \\\"key\\\": 7, \\\"max\\\": 7, \\\"timeframe\\\": 21, \\\"normalize\\\": 7, \\\"now\\\": 7, \\\"ffill\\\": 7, \\\"shift\\\": 7, \\\"opposite\\\": 14, \\\"side\\\": 28, \\\"type\\\": 42, \\\"insertion\\\": 7, \\\"index\\\": 14, \\\"trim\\\": 14, \\\"prepare\\\": 7, \\\"python\\\": 7, \\\"version\\\": 7, \\\"quote\\\": 7, \\\"random\\\": 7, \\\"str\\\": 14, \\\"readable\\\": 14, \\\"duration\\\": 7, \\\"relative\\\": 7, \\\"absolute\\\": 7, \\\"round\\\": 28, \\\"decimals\\\": 7, \\\"down\\\": 7, \\\"secure\\\": 7, \\\"execute\\\": 21, \\\"silently\\\": 7, \\\"string\\\": 14, \\\"character\\\": 7, \\\"style\\\": 7, \\\"terminate\\\": 21, \\\"time\\\": 21, \\\"iso8601\\\": 14, \\\"today\\\": 7, \\\"merge\\\": 7, \\\"dicts\\\": 7, \\\"pid\\\": 7, \\\"env\\\": 7, \\\"name\\\": 14, \\\"or\\\": 35, \\\"none\\\": 21, \\\"float\\\": 7, \\\"near\\\": 7, \\\"almost\\\": 7, \\\"equal\\\": 28, \\\"fill\\\": 14, \\\"absent\\\": 21, \\\"beginning\\\": 7, \\\"middle\\\": 14, \\\"end\\\": 14, \\\"more\\\": 28, \\\"than\\\": 35, \\\"set\\\": 28, \\\"acosc\\\": 7, \\\"ad\\\": 21, \\\"adosc\\\": 7, \\\"adx\\\": 7, \\\"adxr\\\": 7, \\\"alligator\\\": 7, \\\"alma\\\": 7, \\\"ao\\\": 7, \\\"apo\\\": 7, \\\"aroon\\\": 14, \\\"osc\\\": 14, \\\"atr\\\": 7, \\\"avgprice\\\": 7, \\\"bandpass\\\": 7, \\\"beta\\\": 7, \\\"bollinger\\\": 14, \\\"bands\\\": 14, \\\"width\\\": 7, \\\"bop\\\": 7, \\\"cc\\\": 7, \\\"cci\\\": 7, \\\"cfo\\\": 7, \\\"cg\\\": 7, \\\"chande\\\": 7, \\\"chop\\\": 7, \\\"cksp\\\": 7, \\\"cmo\\\": 7, \\\"correl\\\": 7, \\\"correlation\\\": 7, \\\"cycle\\\": 7, \\\"cvi\\\": 7, \\\"cwma\\\": 7, \\\"damiani\\\": 7, \\\"volatmeter\\\": 7, \\\"dec\\\": 7, \\\"decycler\\\": 7, \\\"dema\\\": 7, \\\"devstop\\\": 7, \\\"di\\\": 7, \\\"dm\\\": 7, \\\"donchian\\\": 7, \\\"dpo\\\": 7, \\\"dti\\\": 7, \\\"dx\\\": 7, \\\"edcf\\\": 7, \\\"efi\\\": 7, \\\"ema\\\": 7, \\\"emd\\\": 7, \\\"emv\\\": 7, \\\"epma\\\": 7, \\\"er\\\": 7, \\\"eri\\\": 7, \\\"fisher\\\": 7, \\\"fosc\\\": 7, \\\"frama\\\": 7, \\\"fwma\\\": 7, \\\"gator\\\": 7, \\\"gauss\\\": 7, \\\"heikin\\\": 7, \\\"ashi\\\": 7, \\\"high\\\": 14, \\\"pass\\\": 35, \\\"pole\\\": 14, \\\"hma\\\": 7, \\\"hurst\\\": 7, \\\"hwma\\\": 7, \\\"ichimoku\\\": 14, \\\"cloud\\\": 14, \\\"seq\\\": 7, \\\"ift\\\": 7, \\\"rsi\\\": 14, \\\"itrend\\\": 7, \\\"jma\\\": 7, \\\"jsa\\\": 7, \\\"kama\\\": 7, \\\"kaufmanstop\\\": 7, \\\"kdj\\\": 7, \\\"kelner\\\": 7, \\\"channels\\\": 7, \\\"kst\\\": 7, \\\"kurtosis\\\": 7, \\\"kvo\\\": 7, \\\"linearreg\\\": 28, \\\"angle\\\": 7, \\\"intercept\\\": 7, \\\"slope\\\": 7, \\\"lrsi\\\": 7, \\\"ma\\\": 7, \\\"maaq\\\": 7, \\\"mab\\\": 7, \\\"macd\\\": 7, \\\"mama\\\": 7, \\\"marketfi\\\": 7, \\\"mass\\\": 7, \\\"mcginley\\\": 7, \\\"dynamic\\\": 7, \\\"mean\\\": 7, \\\"median\\\": 7, \\\"medprice\\\": 7, \\\"mfi\\\": 7, \\\"midpoint\\\": 7, \\\"midprice\\\": 7, \\\"minmax\\\": 7, \\\"mom\\\": 7, \\\"mwdx\\\": 7, \\\"natr\\\": 7, \\\"nma\\\": 7, \\\"nvi\\\": 7, \\\"obv\\\": 7, \\\"pfe\\\": 7, \\\"pivot\\\": 7, \\\"pivot1\\\": 7, \\\"pivot2\\\": 7, \\\"pivot3\\\": 7, \\\"pivot4\\\": 7, \\\"pma\\\": 7, \\\"ppo\\\": 7, \\\"pvi\\\": 7, \\\"pwma\\\": 7, \\\"qstick\\\": 7, \\\"reflex\\\": 7, \\\"rma\\\": 7, \\\"roc\\\": 7, \\\"rocp\\\": 7, \\\"rocr\\\": 7, \\\"rocr100\\\": 7, \\\"roofing\\\": 7, \\\"rsmk\\\": 7, \\\"rsx\\\": 7, \\\"rvi\\\": 7, \\\"safezonestop\\\": 7, \\\"sar\\\": 7, \\\"sinwma\\\": 7, \\\"skew\\\": 7, \\\"sma\\\": 7, \\\"smma\\\": 7, \\\"sqwma\\\": 7, \\\"srsi\\\": 7, \\\"srwma\\\": 7, \\\"stc\\\": 7, \\\"stddev\\\": 7, \\\"stoch\\\": 7, \\\"stochf\\\": 7, \\\"supersmoother\\\": 14, \\\"3\\\": 7, \\\"supertrend\\\": 7, \\\"swma\\\": 7, \\\"t3\\\": 7, \\\"tema\\\": 7, \\\"trange\\\": 7, \\\"trendflex\\\": 7, \\\"trima\\\": 7, \\\"trix\\\": 7, \\\"tsf\\\": 7, \\\"tsi\\\": 7, \\\"ttm\\\": 14, \\\"trend\\\": 7, \\\"typprice\\\": 7, \\\"ui\\\": 7, \\\"ultosc\\\": 7, \\\"var\\\": 7, \\\"vi\\\": 7, \\\"vidya\\\": 7, \\\"vlma\\\": 7, \\\"vosc\\\": 7, \\\"voss\\\": 7, \\\"vpci\\\": 7, \\\"vpt\\\": 7, \\\"vpwma\\\": 7, \\\"vwap\\\": 7, \\\"vwma\\\": 7, \\\"vwmacd\\\": 7, \\\"wad\\\": 7, \\\"wclprice\\\": 7, \\\"wilders\\\": 7, \\\"willr\\\": 7, \\\"wma\\\": 7, \\\"wt\\\": 7, \\\"zlema\\\": 7, \\\"zscore\\\": 7, \\\"waddah\\\": 7, \\\"attr\\\": 7, \\\"explosion\\\": 7, \\\"stiffness\\\": 7, \\\"squeeze\\\": 14, \\\"support\\\": 7, \\\"resistance\\\": 7, \\\"breaks\\\": 7, \\\"momentum\\\": 7, \\\"hull\\\": 7, \\\"suit\\\": 7, \\\"volume\\\": 7, \\\"as\\\": 21, \\\"exchange\\\": 35, \\\"spot\\\": 63, \\\"store\\\": 28, \\\"state\\\": 28, \\\"reset\\\": 14, \\\"properly\\\": 7, \\\"isolated\\\": 35, \\\"backtest\\\": 21, \\\"method\\\": 35, \\\"works\\\": 14, \\\"backfunction\\\": 7, \\\"accepts\\\": 7, \\\"1m\\\": 7, \\\"difference\\\": 14, \\\"passed\\\": 7, \\\"affected\\\": 7, \\\"by\\\": 14, \\\"running\\\": 7, \\\"backtests\\\": 7, \\\"igcdex\\\": 7, \\\"open\\\": 84, \\\"pl\\\": 7, \\\"total\\\": 14, \\\"metrics\\\": 7, \\\"without\\\": 28, \\\"fee\\\": 21, \\\"daily\\\": 14, \\\"stores\\\": 7, \\\"portfolio\\\": 21, \\\"value\\\": 49, \\\"order\\\": 140, \\\"property\\\": 98, \\\"take\\\": 98, \\\"profit\\\": 112, \\\"sorted\\\": 7, \\\"has\\\": 21, \\\"long\\\": 70, \\\"short\\\": 56, \\\"filters\\\": 14, \\\"go\\\": 21, \\\"same\\\": 14, \\\"rate\\\": 7, \\\"filter\\\": 7, \\\"forming\\\": 21, \\\"increasing\\\": 14, \\\"smart\\\": 14, \\\"enough\\\": 14, \\\"positions\\\": 21, \\\"via\\\": 28, \\\"liquidate\\\": 7, \\\"modifying\\\": 21, \\\"part\\\": 14, \\\"already\\\": 14, \\\"reduced\\\": 35, \\\"must\\\": 7, \\\"be\\\": 42, \\\"able\\\": 42, \\\"similar\\\": 7, \\\"on\\\": 70, \\\"canceled\\\": 7, \\\"increased\\\": 14, \\\"vars\\\": 14, \\\"like\\\": 7, \\\"example\\\": 7, \\\"docs\\\": 7, \\\"points\\\": 21, \\\"reducing\\\": 7, \\\"shared\\\": 7, \\\"buy\\\": 21, \\\"sell\\\": 21, \\\"taking\\\": 7, \\\"closes\\\": 7, \\\"updating\\\": 7, \\\"count\\\": 14, \\\"before\\\": 28, \\\"leverage\\\": 14, \\\"liquidation\\\": 14, \\\"mark\\\": 7, \\\"log\\\": 7, \\\"using\\\": 7, \\\"low\\\": 7, \\\"default\\\": 7, \\\"hyperparameters\\\": 7, \\\"update\\\": 35, \\\"replaced\\\": 14, \\\"run\\\": 7, \\\"shorting\\\": 7, \\\"cannot\\\": 21, \\\"greater\\\": 7, \\\"zero\\\": 7, \\\"balances\\\": 14, \\\"capital\\\": 7, \\\"raises\\\": 7, \\\"error\\\": 7, \\\"variables\\\": 7, \\\"new\\\": 35, \\\"immediately\\\": 7, \\\"terminate1\\\": 7, \\\"terminate2\\\": 7, \\\"chart\\\": 7, \\\"values\\\": 7, \\\"proper\\\": 7, \\\"handling\\\": 7, \\\"cancellation\\\": 7, \\\"current\\\": 42, \\\"data\\\": 7, \\\"increase\\\": 21, \\\"initiating\\\": 7, \\\"roi\\\": 7, \\\"cost\\\": 7, \\\"raise\\\": 21, \\\"if\\\": 21, \\\"trying\\\": 21, \\\"spend\\\": 7, \\\"less\\\": 14, \\\"consider\\\": 7, \\\"executed\\\": 7, \\\"handled\\\": 7, \\\"correctly\\\": 14, \\\"cancelling\\\": 7, \\\"events\\\": 7, \\\"reduction\\\": 7, \\\"both\\\": 7, \\\"batch\\\": 7, \\\"add\\\": 42, \\\"including\\\": 7, \\\"previous\\\": 7, \\\"have\\\": 7, \\\"correct\\\": 7, \\\"exchanges\\\": 7, \\\"creating\\\": 7, \\\"fix\\\": 7, \\\"len\\\": 7, \\\"ticker\\\": 14, \\\"anchor\\\": 7, \\\"crossed\\\": 7, \\\"risk\\\": 21, \\\"limit\\\": 7, \\\"numpy\\\": 7, \\\"pandas\\\": 7, \\\"sum\\\": 7, \\\"floats\\\": 14, \\\"subtract\\\": 7, \\\"prices\\\": 7, \\\"returns\\\": 7, \\\"combinations\\\": 7, \\\"repeat\\\": 7}\", \"word_docs\": \"{\\\"jesse\\\": 2210, \\\"test\\\": 2652, \\\"route\\\": 56, \\\"backtesting\\\": 21, \\\"how\\\": 1326, \\\"does\\\": 884, \\\"one\\\": 28, \\\"the\\\": 1786, \\\"verify\\\": 442, \\\"what\\\": 884, \\\"in\\\": 2676, \\\"explain\\\": 442, \\\"functionality\\\": 442, \\\"you\\\": 442, \\\"can\\\": 520, \\\"assertions\\\": 442, \\\"used\\\": 442, \\\"are\\\": 472, \\\"jesse's\\\": 442, \\\"is\\\": 598, \\\"suite\\\": 442, \\\"implemented\\\": 448, \\\"purpose\\\": 442, \\\"what's\\\": 442, \\\"of\\\": 466, \\\"me\\\": 442, \\\"show\\\": 442, \\\"to\\\": 640, \\\"routes\\\": 28, \\\"three\\\": 7, \\\"cancel\\\": 28, \\\"orders\\\": 147, \\\"all\\\": 7, \\\"with\\\": 98, \\\"and\\\": 112, \\\"closing\\\": 21, \\\"stop\\\": 126, \\\"position\\\": 287, \\\"opening\\\": 56, \\\"loss\\\": 105, \\\"should\\\": 84, \\\"only\\\": 21, \\\"reduce\\\": 42, \\\"submit\\\": 42, \\\"not\\\": 28, \\\"when\\\": 7, \\\"closed\\\": 7, \\\"includes\\\": 14, \\\"price\\\": 91, \\\"candle\\\": 70, \\\"minutes\\\": 14, \\\"generate\\\": 14, \\\"from\\\": 7, \\\"bearish\\\": 7, \\\"bullish\\\": 7, \\\"split\\\": 7, \\\"dict\\\": 7, \\\"np\\\": 21, \\\"array\\\": 21, \\\"strategy\\\": 63, \\\"simple\\\": 7, \\\"completed\\\": 21, \\\"a\\\": 70, \\\"trade\\\": 35, \\\"trades\\\": 42, \\\"two\\\": 14, \\\"after\\\": 98, \\\"exiting\\\": 7, \\\"entry\\\": 70, \\\"size\\\": 84, \\\"properties\\\": 21, \\\"exit\\\": 14, \\\"qty\\\": 70, \\\"handle\\\": 7, \\\"multiple\\\": 42, \\\"each\\\": 7, \\\"other\\\": 7, \\\"close\\\": 35, \\\"too\\\": 14, \\\"conflicting\\\": 14, \\\"2\\\": 14, \\\"append\\\": 7, \\\"flush\\\": 7, \\\"last\\\": 7, \\\"item\\\": 21, \\\"get\\\": 91, \\\"past\\\": 14, \\\"increases\\\": 7, \\\"at\\\": 42, \\\"drop\\\": 7, \\\"balance\\\": 42, \\\"for\\\": 77, \\\"validation\\\": 14, \\\"futures\\\": 35, \\\"market\\\": 56, \\\"negative\\\": 7, \\\"wallet\\\": 7, \\\"available\\\": 21, \\\"margin\\\": 14, \\\"app\\\": 28, \\\"currency\\\": 14, \\\"mode\\\": 56, \\\"arrow\\\": 14, \\\"timestamp\\\": 63, \\\"base\\\": 7, \\\"asset\\\": 14, \\\"binary\\\": 7, \\\"search\\\": 14, \\\"orderbook\\\": 28, \\\"clean\\\": 7, \\\"list\\\": 28, \\\"color\\\": 7, \\\"convert\\\": 14, \\\"number\\\": 7, \\\"dashless\\\": 7, \\\"symbol\\\": 14, \\\"dashy\\\": 7, \\\"days\\\": 7, \\\"date\\\": 21, \\\"diff\\\": 7, \\\"hp\\\": 7, \\\"dna\\\": 21, \\\"exception\\\": 49, \\\"dump\\\": 7, \\\"average\\\": 35, \\\"estimate\\\": 28, \\\"pnl\\\": 28, \\\"percentage\\\": 14, \\\"exists\\\": 7, \\\"file\\\": 7, \\\"floor\\\": 7, \\\"precision\\\": 7, \\\"format\\\": 14, \\\"unique\\\": 14, \\\"id\\\": 14, \\\"source\\\": 7, \\\"config\\\": 7, \\\"class\\\": 28, \\\"insecure\\\": 7, \\\"hash\\\": 14, \\\"insert\\\": 7, \\\"debuggable\\\": 7, \\\"debugging\\\": 7, \\\"candles\\\": 77, \\\"importing\\\": 7, \\\"live\\\": 21, \\\"livetrading\\\": 7, \\\"optimizing\\\": 7, \\\"trading\\\": 7, \\\"paper\\\": 7, \\\"testing\\\": 7, \\\"unit\\\": 7, \\\"key\\\": 7, \\\"max\\\": 7, \\\"timeframe\\\": 21, \\\"normalize\\\": 7, \\\"now\\\": 7, \\\"ffill\\\": 7, \\\"shift\\\": 7, \\\"opposite\\\": 14, \\\"side\\\": 28, \\\"type\\\": 42, \\\"index\\\": 14, \\\"insertion\\\": 7, \\\"trim\\\": 14, \\\"prepare\\\": 7, \\\"version\\\": 7, \\\"python\\\": 7, \\\"quote\\\": 7, \\\"random\\\": 7, \\\"str\\\": 14, \\\"readable\\\": 14, \\\"duration\\\": 7, \\\"relative\\\": 7, \\\"absolute\\\": 7, \\\"round\\\": 28, \\\"decimals\\\": 7, \\\"down\\\": 7, \\\"secure\\\": 7, \\\"execute\\\": 21, \\\"silently\\\": 7, \\\"character\\\": 7, \\\"string\\\": 14, \\\"style\\\": 7, \\\"terminate\\\": 21, \\\"time\\\": 21, \\\"iso8601\\\": 14, \\\"today\\\": 7, \\\"merge\\\": 7, \\\"dicts\\\": 7, \\\"pid\\\": 7, \\\"env\\\": 7, \\\"name\\\": 14, \\\"none\\\": 21, \\\"or\\\": 35, \\\"float\\\": 7, \\\"near\\\": 7, \\\"equal\\\": 28, \\\"almost\\\": 7, \\\"absent\\\": 21, \\\"fill\\\": 14, \\\"beginning\\\": 7, \\\"end\\\": 14, \\\"middle\\\": 14, \\\"more\\\": 28, \\\"set\\\": 28, \\\"than\\\": 35, \\\"acosc\\\": 7, \\\"ad\\\": 21, \\\"adosc\\\": 7, \\\"adx\\\": 7, \\\"adxr\\\": 7, \\\"alligator\\\": 7, \\\"alma\\\": 7, \\\"ao\\\": 7, \\\"apo\\\": 7, \\\"aroon\\\": 14, \\\"osc\\\": 14, \\\"atr\\\": 7, \\\"avgprice\\\": 7, \\\"bandpass\\\": 7, \\\"beta\\\": 7, \\\"bollinger\\\": 14, \\\"bands\\\": 14, \\\"width\\\": 7, \\\"bop\\\": 7, \\\"cc\\\": 7, \\\"cci\\\": 7, \\\"cfo\\\": 7, \\\"cg\\\": 7, \\\"chande\\\": 7, \\\"chop\\\": 7, \\\"cksp\\\": 7, \\\"cmo\\\": 7, \\\"correl\\\": 7, \\\"correlation\\\": 7, \\\"cycle\\\": 7, \\\"cvi\\\": 7, \\\"cwma\\\": 7, \\\"volatmeter\\\": 7, \\\"damiani\\\": 7, \\\"dec\\\": 7, \\\"decycler\\\": 7, \\\"dema\\\": 7, \\\"devstop\\\": 7, \\\"di\\\": 7, \\\"dm\\\": 7, \\\"donchian\\\": 7, \\\"dpo\\\": 7, \\\"dti\\\": 7, \\\"dx\\\": 7, \\\"edcf\\\": 7, \\\"efi\\\": 7, \\\"ema\\\": 7, \\\"emd\\\": 7, \\\"emv\\\": 7, \\\"epma\\\": 7, \\\"er\\\": 7, \\\"eri\\\": 7, \\\"fisher\\\": 7, \\\"fosc\\\": 7, \\\"frama\\\": 7, \\\"fwma\\\": 7, \\\"gator\\\": 7, \\\"gauss\\\": 7, \\\"heikin\\\": 7, \\\"ashi\\\": 7, \\\"pass\\\": 35, \\\"high\\\": 14, \\\"pole\\\": 14, \\\"hma\\\": 7, \\\"hurst\\\": 7, \\\"hwma\\\": 7, \\\"cloud\\\": 14, \\\"ichimoku\\\": 14, \\\"seq\\\": 7, \\\"ift\\\": 7, \\\"rsi\\\": 14, \\\"itrend\\\": 7, \\\"jma\\\": 7, \\\"jsa\\\": 7, \\\"kama\\\": 7, \\\"kaufmanstop\\\": 7, \\\"kdj\\\": 7, \\\"channels\\\": 7, \\\"kelner\\\": 7, \\\"kst\\\": 7, \\\"kurtosis\\\": 7, \\\"kvo\\\": 7, \\\"linearreg\\\": 28, \\\"angle\\\": 7, \\\"intercept\\\": 7, \\\"slope\\\": 7, \\\"lrsi\\\": 7, \\\"ma\\\": 7, \\\"maaq\\\": 7, \\\"mab\\\": 7, \\\"macd\\\": 7, \\\"mama\\\": 7, \\\"marketfi\\\": 7, \\\"mass\\\": 7, \\\"dynamic\\\": 7, \\\"mcginley\\\": 7, \\\"mean\\\": 7, \\\"median\\\": 7, \\\"medprice\\\": 7, \\\"mfi\\\": 7, \\\"midpoint\\\": 7, \\\"midprice\\\": 7, \\\"minmax\\\": 7, \\\"mom\\\": 7, \\\"mwdx\\\": 7, \\\"natr\\\": 7, \\\"nma\\\": 7, \\\"nvi\\\": 7, \\\"obv\\\": 7, \\\"pfe\\\": 7, \\\"pivot\\\": 7, \\\"pivot1\\\": 7, \\\"pivot2\\\": 7, \\\"pivot3\\\": 7, \\\"pivot4\\\": 7, \\\"pma\\\": 7, \\\"ppo\\\": 7, \\\"pvi\\\": 7, \\\"pwma\\\": 7, \\\"qstick\\\": 7, \\\"reflex\\\": 7, \\\"rma\\\": 7, \\\"roc\\\": 7, \\\"rocp\\\": 7, \\\"rocr\\\": 7, \\\"rocr100\\\": 7, \\\"roofing\\\": 7, \\\"rsmk\\\": 7, \\\"rsx\\\": 7, \\\"rvi\\\": 7, \\\"safezonestop\\\": 7, \\\"sar\\\": 7, \\\"sinwma\\\": 7, \\\"skew\\\": 7, \\\"sma\\\": 7, \\\"smma\\\": 7, \\\"sqwma\\\": 7, \\\"srsi\\\": 7, \\\"srwma\\\": 7, \\\"stc\\\": 7, \\\"stddev\\\": 7, \\\"stoch\\\": 7, \\\"stochf\\\": 7, \\\"supersmoother\\\": 14, \\\"3\\\": 7, \\\"supertrend\\\": 7, \\\"swma\\\": 7, \\\"t3\\\": 7, \\\"tema\\\": 7, \\\"trange\\\": 7, \\\"trendflex\\\": 7, \\\"trima\\\": 7, \\\"trix\\\": 7, \\\"tsf\\\": 7, \\\"tsi\\\": 7, \\\"trend\\\": 7, \\\"ttm\\\": 14, \\\"typprice\\\": 7, \\\"ui\\\": 7, \\\"ultosc\\\": 7, \\\"var\\\": 7, \\\"vi\\\": 7, \\\"vidya\\\": 7, \\\"vlma\\\": 7, \\\"vosc\\\": 7, \\\"voss\\\": 7, \\\"vpci\\\": 7, \\\"vpt\\\": 7, \\\"vpwma\\\": 7, \\\"vwap\\\": 7, \\\"vwma\\\": 7, \\\"vwmacd\\\": 7, \\\"wad\\\": 7, \\\"wclprice\\\": 7, \\\"wilders\\\": 7, \\\"willr\\\": 7, \\\"wma\\\": 7, \\\"wt\\\": 7, \\\"zlema\\\": 7, \\\"zscore\\\": 7, \\\"explosion\\\": 7, \\\"waddah\\\": 7, \\\"attr\\\": 7, \\\"stiffness\\\": 7, \\\"squeeze\\\": 14, \\\"resistance\\\": 7, \\\"breaks\\\": 7, \\\"support\\\": 7, \\\"momentum\\\": 7, \\\"hull\\\": 7, \\\"suit\\\": 7, \\\"volume\\\": 7, \\\"as\\\": 21, \\\"exchange\\\": 35, \\\"spot\\\": 63, \\\"store\\\": 21, \\\"isolated\\\": 35, \\\"backtest\\\": 21, \\\"state\\\": 28, \\\"reset\\\": 14, \\\"properly\\\": 7, \\\"works\\\": 14, \\\"method\\\": 35, \\\"backfunction\\\": 7, \\\"1m\\\": 7, \\\"difference\\\": 14, \\\"accepts\\\": 7, \\\"running\\\": 7, \\\"affected\\\": 7, \\\"by\\\": 14, \\\"backtests\\\": 7, \\\"passed\\\": 7, \\\"igcdex\\\": 7, \\\"total\\\": 14, \\\"pl\\\": 7, \\\"open\\\": 77, \\\"without\\\": 28, \\\"metrics\\\": 7, \\\"fee\\\": 21, \\\"daily\\\": 14, \\\"portfolio\\\": 21, \\\"stores\\\": 7, \\\"value\\\": 35, \\\"property\\\": 98, \\\"order\\\": 133, \\\"take\\\": 98, \\\"profit\\\": 105, \\\"sorted\\\": 7, \\\"has\\\": 21, \\\"long\\\": 70, \\\"short\\\": 56, \\\"filters\\\": 14, \\\"same\\\": 14, \\\"go\\\": 21, \\\"rate\\\": 7, \\\"filter\\\": 7, \\\"forming\\\": 21, \\\"increasing\\\": 14, \\\"smart\\\": 14, \\\"enough\\\": 14, \\\"positions\\\": 21, \\\"via\\\": 28, \\\"liquidate\\\": 7, \\\"modifying\\\": 21, \\\"part\\\": 14, \\\"reduced\\\": 35, \\\"already\\\": 14, \\\"must\\\": 7, \\\"able\\\": 42, \\\"similar\\\": 7, \\\"be\\\": 42, \\\"on\\\": 56, \\\"canceled\\\": 7, \\\"increased\\\": 14, \\\"vars\\\": 14, \\\"like\\\": 7, \\\"example\\\": 7, \\\"docs\\\": 7, \\\"points\\\": 21, \\\"reducing\\\": 7, \\\"shared\\\": 7, \\\"buy\\\": 14, \\\"sell\\\": 14, \\\"taking\\\": 7, \\\"closes\\\": 7, \\\"updating\\\": 7, \\\"count\\\": 14, \\\"before\\\": 28, \\\"leverage\\\": 14, \\\"liquidation\\\": 14, \\\"mark\\\": 7, \\\"log\\\": 7, \\\"low\\\": 7, \\\"using\\\": 7, \\\"hyperparameters\\\": 7, \\\"default\\\": 7, \\\"update\\\": 35, \\\"replaced\\\": 14, \\\"run\\\": 7, \\\"shorting\\\": 7, \\\"greater\\\": 7, \\\"cannot\\\": 21, \\\"zero\\\": 7, \\\"balances\\\": 14, \\\"capital\\\": 7, \\\"error\\\": 7, \\\"raises\\\": 7, \\\"variables\\\": 7, \\\"new\\\": 35, \\\"immediately\\\": 7, \\\"terminate1\\\": 7, \\\"terminate2\\\": 7, \\\"values\\\": 7, \\\"chart\\\": 7, \\\"handling\\\": 7, \\\"cancellation\\\": 7, \\\"proper\\\": 7, \\\"current\\\": 42, \\\"data\\\": 7, \\\"increase\\\": 21, \\\"initiating\\\": 7, \\\"roi\\\": 7, \\\"cost\\\": 7, \\\"spend\\\": 7, \\\"raise\\\": 21, \\\"if\\\": 21, \\\"trying\\\": 21, \\\"less\\\": 14, \\\"executed\\\": 7, \\\"consider\\\": 7, \\\"correctly\\\": 14, \\\"cancelling\\\": 7, \\\"handled\\\": 7, \\\"events\\\": 7, \\\"both\\\": 7, \\\"reduction\\\": 7, \\\"batch\\\": 7, \\\"add\\\": 35, \\\"including\\\": 7, \\\"previous\\\": 7, \\\"exchanges\\\": 7, \\\"have\\\": 7, \\\"creating\\\": 7, \\\"correct\\\": 7, \\\"fix\\\": 7, \\\"len\\\": 7, \\\"ticker\\\": 14, \\\"anchor\\\": 7, \\\"crossed\\\": 7, \\\"risk\\\": 21, \\\"limit\\\": 7, \\\"pandas\\\": 7, \\\"numpy\\\": 7, \\\"sum\\\": 7, \\\"floats\\\": 14, \\\"subtract\\\": 7, \\\"prices\\\": 7, \\\"returns\\\": 7, \\\"repeat\\\": 7, \\\"combinations\\\": 7}\", \"index_docs\": \"{\\\"4\\\": 2210, \\\"2\\\": 2652, \\\"50\\\": 56, \\\"105\\\": 21, \\\"5\\\": 1326, \\\"6\\\": 884, \\\"84\\\": 28, \\\"3\\\": 1786, \\\"14\\\": 442, \\\"7\\\": 884, \\\"1\\\": 2676, \\\"16\\\": 442, \\\"17\\\": 442, \\\"15\\\": 442, \\\"10\\\": 520, \\\"18\\\": 442, \\\"19\\\": 442, \\\"11\\\": 472, \\\"20\\\": 442, \\\"9\\\": 598, \\\"21\\\": 442, \\\"13\\\": 448, \\\"23\\\": 442, \\\"22\\\": 442, \\\"12\\\": 466, \\\"25\\\": 442, \\\"24\\\": 442, \\\"8\\\": 640, \\\"85\\\": 28, \\\"211\\\": 7, \\\"86\\\": 28, \\\"27\\\": 147, \\\"212\\\": 7, \\\"33\\\": 98, \\\"30\\\": 112, \\\"106\\\": 21, \\\"29\\\": 126, \\\"26\\\": 287, \\\"54\\\": 56, \\\"31\\\": 105, \\\"39\\\": 84, \\\"107\\\": 21, \\\"61\\\": 42, \\\"60\\\": 42, \\\"87\\\": 28, \\\"213\\\": 7, \\\"214\\\": 7, \\\"142\\\": 14, \\\"34\\\": 91, \\\"45\\\": 70, \\\"144\\\": 14, \\\"143\\\": 14, \\\"215\\\": 7, \\\"216\\\": 7, \\\"217\\\": 7, \\\"218\\\": 7, \\\"219\\\": 7, \\\"108\\\": 21, \\\"109\\\": 21, \\\"51\\\": 63, \\\"220\\\": 7, \\\"110\\\": 21, \\\"46\\\": 70, \\\"62\\\": 35, \\\"63\\\": 42, \\\"145\\\": 14, \\\"35\\\": 98, \\\"221\\\": 7, \\\"40\\\": 70, \\\"41\\\": 84, \\\"111\\\": 21, \\\"146\\\": 14, \\\"47\\\": 70, \\\"222\\\": 7, \\\"64\\\": 42, \\\"223\\\": 7, \\\"224\\\": 7, \\\"73\\\": 35, \\\"147\\\": 14, \\\"148\\\": 14, \\\"149\\\": 14, \\\"225\\\": 7, \\\"226\\\": 7, \\\"227\\\": 7, \\\"112\\\": 21, \\\"38\\\": 91, \\\"150\\\": 14, \\\"228\\\": 7, \\\"65\\\": 42, \\\"229\\\": 7, \\\"66\\\": 42, \\\"43\\\": 77, \\\"151\\\": 14, \\\"74\\\": 35, \\\"55\\\": 56, \\\"230\\\": 7, \\\"231\\\": 7, \\\"113\\\": 21, \\\"152\\\": 14, \\\"88\\\": 28, \\\"153\\\": 14, \\\"56\\\": 56, \\\"154\\\": 14, \\\"52\\\": 63, \\\"232\\\": 7, \\\"155\\\": 14, \\\"233\\\": 7, \\\"156\\\": 14, \\\"89\\\": 28, \\\"234\\\": 7, \\\"90\\\": 28, \\\"235\\\": 7, \\\"157\\\": 14, \\\"236\\\": 7, \\\"237\\\": 7, \\\"158\\\": 14, \\\"238\\\": 7, \\\"240\\\": 7, \\\"114\\\": 21, \\\"239\\\": 7, \\\"241\\\": 7, \\\"115\\\": 21, \\\"58\\\": 49, \\\"242\\\": 7, \\\"67\\\": 35, \\\"91\\\": 28, \\\"92\\\": 28, \\\"159\\\": 14, \\\"244\\\": 7, \\\"243\\\": 7, \\\"245\\\": 7, \\\"246\\\": 7, \\\"160\\\": 14, \\\"161\\\": 14, \\\"162\\\": 14, \\\"247\\\": 7, \\\"248\\\": 7, \\\"93\\\": 28, \\\"249\\\": 7, \\\"163\\\": 14, \\\"250\\\": 7, \\\"251\\\": 7, \\\"252\\\": 7, \\\"44\\\": 77, \\\"253\\\": 7, \\\"116\\\": 21, \\\"254\\\": 7, \\\"255\\\": 7, \\\"257\\\": 7, \\\"256\\\": 7, \\\"259\\\": 7, \\\"258\\\": 7, \\\"260\\\": 7, \\\"261\\\": 7, \\\"117\\\": 21, \\\"262\\\": 7, \\\"263\\\": 7, \\\"264\\\": 7, \\\"265\\\": 7, \\\"164\\\": 14, \\\"94\\\": 28, \\\"68\\\": 42, \\\"165\\\": 14, \\\"266\\\": 7, \\\"166\\\": 14, \\\"267\\\": 7, \\\"269\\\": 7, \\\"268\\\": 7, \\\"270\\\": 7, \\\"271\\\": 7, \\\"167\\\": 14, \\\"168\\\": 14, \\\"272\\\": 7, \\\"273\\\": 7, \\\"274\\\": 7, \\\"95\\\": 28, \\\"275\\\": 7, \\\"276\\\": 7, \\\"277\\\": 7, \\\"118\\\": 21, \\\"278\\\": 7, \\\"279\\\": 7, \\\"169\\\": 14, \\\"280\\\": 7, \\\"119\\\": 21, \\\"120\\\": 21, \\\"170\\\": 14, \\\"281\\\": 7, \\\"282\\\": 7, \\\"283\\\": 7, \\\"284\\\": 7, \\\"285\\\": 7, \\\"171\\\": 14, \\\"121\\\": 21, \\\"75\\\": 35, \\\"286\\\": 7, \\\"287\\\": 7, \\\"96\\\": 28, \\\"288\\\": 7, \\\"122\\\": 21, \\\"172\\\": 14, \\\"289\\\": 7, \\\"174\\\": 14, \\\"173\\\": 14, \\\"97\\\": 28, \\\"98\\\": 28, \\\"76\\\": 35, \\\"290\\\": 7, \\\"123\\\": 21, \\\"291\\\": 7, \\\"292\\\": 7, \\\"293\\\": 7, \\\"294\\\": 7, \\\"295\\\": 7, \\\"296\\\": 7, \\\"297\\\": 7, \\\"175\\\": 14, \\\"176\\\": 14, \\\"298\\\": 7, \\\"299\\\": 7, \\\"300\\\": 7, \\\"301\\\": 7, \\\"177\\\": 14, \\\"178\\\": 14, \\\"302\\\": 7, \\\"303\\\": 7, \\\"304\\\": 7, \\\"305\\\": 7, \\\"306\\\": 7, \\\"307\\\": 7, \\\"308\\\": 7, \\\"309\\\": 7, \\\"310\\\": 7, \\\"311\\\": 7, \\\"312\\\": 7, \\\"313\\\": 7, \\\"314\\\": 7, \\\"315\\\": 7, \\\"316\\\": 7, \\\"318\\\": 7, \\\"317\\\": 7, \\\"319\\\": 7, \\\"320\\\": 7, \\\"321\\\": 7, \\\"322\\\": 7, \\\"323\\\": 7, \\\"324\\\": 7, \\\"325\\\": 7, \\\"326\\\": 7, \\\"327\\\": 7, \\\"328\\\": 7, \\\"329\\\": 7, \\\"330\\\": 7, \\\"331\\\": 7, \\\"332\\\": 7, \\\"333\\\": 7, \\\"334\\\": 7, \\\"335\\\": 7, \\\"336\\\": 7, \\\"337\\\": 7, \\\"338\\\": 7, \\\"339\\\": 7, \\\"340\\\": 7, \\\"341\\\": 7, \\\"342\\\": 7, \\\"343\\\": 7, \\\"344\\\": 7, \\\"77\\\": 35, \\\"179\\\": 14, \\\"180\\\": 14, \\\"345\\\": 7, \\\"346\\\": 7, \\\"347\\\": 7, \\\"182\\\": 14, \\\"181\\\": 14, \\\"348\\\": 7, \\\"349\\\": 7, \\\"183\\\": 14, \\\"350\\\": 7, \\\"351\\\": 7, \\\"352\\\": 7, \\\"353\\\": 7, \\\"354\\\": 7, \\\"355\\\": 7, \\\"357\\\": 7, \\\"356\\\": 7, \\\"358\\\": 7, \\\"359\\\": 7, \\\"360\\\": 7, \\\"99\\\": 28, \\\"361\\\": 7, \\\"362\\\": 7, \\\"363\\\": 7, \\\"364\\\": 7, \\\"365\\\": 7, \\\"366\\\": 7, \\\"367\\\": 7, \\\"368\\\": 7, \\\"369\\\": 7, \\\"370\\\": 7, \\\"371\\\": 7, \\\"373\\\": 7, \\\"372\\\": 7, \\\"374\\\": 7, \\\"375\\\": 7, \\\"376\\\": 7, \\\"377\\\": 7, \\\"378\\\": 7, \\\"379\\\": 7, \\\"380\\\": 7, \\\"381\\\": 7, \\\"382\\\": 7, \\\"383\\\": 7, \\\"384\\\": 7, \\\"385\\\": 7, \\\"386\\\": 7, \\\"387\\\": 7, \\\"388\\\": 7, \\\"389\\\": 7, \\\"390\\\": 7, \\\"391\\\": 7, \\\"392\\\": 7, \\\"393\\\": 7, \\\"394\\\": 7, \\\"395\\\": 7, \\\"396\\\": 7, \\\"397\\\": 7, \\\"398\\\": 7, \\\"399\\\": 7, \\\"400\\\": 7, \\\"401\\\": 7, \\\"402\\\": 7, \\\"403\\\": 7, \\\"404\\\": 7, \\\"405\\\": 7, \\\"406\\\": 7, \\\"407\\\": 7, \\\"408\\\": 7, \\\"409\\\": 7, \\\"410\\\": 7, \\\"411\\\": 7, \\\"412\\\": 7, \\\"413\\\": 7, \\\"414\\\": 7, \\\"415\\\": 7, \\\"416\\\": 7, \\\"417\\\": 7, \\\"418\\\": 7, \\\"419\\\": 7, \\\"420\\\": 7, \\\"184\\\": 14, \\\"421\\\": 7, \\\"422\\\": 7, \\\"423\\\": 7, \\\"424\\\": 7, \\\"425\\\": 7, \\\"426\\\": 7, \\\"427\\\": 7, \\\"428\\\": 7, \\\"429\\\": 7, \\\"430\\\": 7, \\\"431\\\": 7, \\\"432\\\": 7, \\\"185\\\": 14, \\\"433\\\": 7, \\\"434\\\": 7, \\\"435\\\": 7, \\\"436\\\": 7, \\\"437\\\": 7, \\\"438\\\": 7, \\\"439\\\": 7, \\\"440\\\": 7, \\\"441\\\": 7, \\\"442\\\": 7, \\\"443\\\": 7, \\\"444\\\": 7, \\\"445\\\": 7, \\\"446\\\": 7, \\\"447\\\": 7, \\\"448\\\": 7, \\\"449\\\": 7, \\\"450\\\": 7, \\\"451\\\": 7, \\\"452\\\": 7, \\\"453\\\": 7, \\\"454\\\": 7, \\\"455\\\": 7, \\\"458\\\": 7, \\\"456\\\": 7, \\\"457\\\": 7, \\\"459\\\": 7, \\\"186\\\": 14, \\\"461\\\": 7, \\\"462\\\": 7, \\\"460\\\": 7, \\\"463\\\": 7, \\\"464\\\": 7, \\\"465\\\": 7, \\\"466\\\": 7, \\\"124\\\": 21, \\\"78\\\": 35, \\\"53\\\": 63, \\\"100\\\": 21, \\\"79\\\": 35, \\\"125\\\": 21, \\\"101\\\": 28, \\\"187\\\": 14, \\\"467\\\": 7, \\\"188\\\": 14, \\\"80\\\": 35, \\\"468\\\": 7, \\\"470\\\": 7, \\\"189\\\": 14, \\\"469\\\": 7, \\\"473\\\": 7, \\\"472\\\": 7, \\\"190\\\": 14, \\\"474\\\": 7, \\\"471\\\": 7, \\\"475\\\": 7, \\\"191\\\": 14, \\\"476\\\": 7, \\\"42\\\": 77, \\\"102\\\": 28, \\\"477\\\": 7, \\\"126\\\": 21, \\\"192\\\": 14, \\\"127\\\": 21, \\\"478\\\": 7, \\\"59\\\": 35, \\\"36\\\": 98, \\\"28\\\": 133, \\\"37\\\": 98, \\\"32\\\": 105, \\\"479\\\": 7, \\\"128\\\": 21, \\\"48\\\": 70, \\\"57\\\": 56, \\\"193\\\": 14, \\\"194\\\": 14, \\\"129\\\": 21, \\\"480\\\": 7, \\\"481\\\": 7, \\\"130\\\": 21, \\\"195\\\": 14, \\\"196\\\": 14, \\\"197\\\": 14, \\\"131\\\": 21, \\\"103\\\": 28, \\\"482\\\": 7, \\\"132\\\": 21, \\\"198\\\": 14, \\\"81\\\": 35, \\\"199\\\": 14, \\\"483\\\": 7, \\\"70\\\": 42, \\\"484\\\": 7, \\\"69\\\": 42, \\\"49\\\": 56, \\\"485\\\": 7, \\\"200\\\": 14, \\\"201\\\": 14, \\\"486\\\": 7, \\\"487\\\": 7, \\\"488\\\": 7, \\\"133\\\": 21, \\\"489\\\": 7, \\\"490\\\": 7, \\\"134\\\": 14, \\\"135\\\": 14, \\\"491\\\": 7, \\\"492\\\": 7, \\\"493\\\": 7, \\\"202\\\": 14, \\\"104\\\": 28, \\\"203\\\": 14, \\\"204\\\": 14, \\\"494\\\": 7, \\\"495\\\": 7, \\\"497\\\": 7, \\\"496\\\": 7, \\\"499\\\": 7, \\\"498\\\": 7, \\\"82\\\": 35, \\\"205\\\": 14, \\\"500\\\": 7, \\\"501\\\": 7, \\\"502\\\": 7, \\\"136\\\": 21, \\\"503\\\": 7, \\\"206\\\": 14, \\\"504\\\": 7, \\\"506\\\": 7, \\\"505\\\": 7, \\\"507\\\": 7, \\\"83\\\": 35, \\\"508\\\": 7, \\\"509\\\": 7, \\\"510\\\": 7, \\\"512\\\": 7, \\\"511\\\": 7, \\\"514\\\": 7, \\\"515\\\": 7, \\\"513\\\": 7, \\\"71\\\": 42, \\\"516\\\": 7, \\\"137\\\": 21, \\\"517\\\": 7, \\\"518\\\": 7, \\\"519\\\": 7, \\\"520\\\": 7, \\\"138\\\": 21, \\\"139\\\": 21, \\\"140\\\": 21, \\\"207\\\": 14, \\\"522\\\": 7, \\\"521\\\": 7, \\\"208\\\": 14, \\\"524\\\": 7, \\\"523\\\": 7, \\\"525\\\": 7, \\\"527\\\": 7, \\\"526\\\": 7, \\\"528\\\": 7, \\\"72\\\": 35, \\\"529\\\": 7, \\\"530\\\": 7, \\\"533\\\": 7, \\\"531\\\": 7, \\\"534\\\": 7, \\\"532\\\": 7, \\\"535\\\": 7, \\\"536\\\": 7, \\\"209\\\": 14, \\\"537\\\": 7, \\\"538\\\": 7, \\\"141\\\": 21, \\\"539\\\": 7, \\\"541\\\": 7, \\\"540\\\": 7, \\\"542\\\": 7, \\\"210\\\": 14, \\\"543\\\": 7, \\\"544\\\": 7, \\\"545\\\": 7, \\\"547\\\": 7, \\\"546\\\": 7}\", \"index_word\": \"{\\\"1\\\": \\\"in\\\", \\\"2\\\": \\\"test\\\", \\\"3\\\": \\\"the\\\", \\\"4\\\": \\\"jesse\\\", \\\"5\\\": \\\"how\\\", \\\"6\\\": \\\"does\\\", \\\"7\\\": \\\"what\\\", \\\"8\\\": \\\"to\\\", \\\"9\\\": \\\"is\\\", \\\"10\\\": \\\"can\\\", \\\"11\\\": \\\"are\\\", \\\"12\\\": \\\"of\\\", \\\"13\\\": \\\"implemented\\\", \\\"14\\\": \\\"verify\\\", \\\"15\\\": \\\"you\\\", \\\"16\\\": \\\"explain\\\", \\\"17\\\": \\\"functionality\\\", \\\"18\\\": \\\"assertions\\\", \\\"19\\\": \\\"used\\\", \\\"20\\\": \\\"jesse's\\\", \\\"21\\\": \\\"suite\\\", \\\"22\\\": \\\"what's\\\", \\\"23\\\": \\\"purpose\\\", \\\"24\\\": \\\"show\\\", \\\"25\\\": \\\"me\\\", \\\"26\\\": \\\"position\\\", \\\"27\\\": \\\"orders\\\", \\\"28\\\": \\\"order\\\", \\\"29\\\": \\\"stop\\\", \\\"30\\\": \\\"and\\\", \\\"31\\\": \\\"loss\\\", \\\"32\\\": \\\"profit\\\", \\\"33\\\": \\\"with\\\", \\\"34\\\": \\\"price\\\", \\\"35\\\": \\\"after\\\", \\\"36\\\": \\\"property\\\", \\\"37\\\": \\\"take\\\", \\\"38\\\": \\\"get\\\", \\\"39\\\": \\\"should\\\", \\\"40\\\": \\\"entry\\\", \\\"41\\\": \\\"size\\\", \\\"42\\\": \\\"open\\\", \\\"43\\\": \\\"for\\\", \\\"44\\\": \\\"candles\\\", \\\"45\\\": \\\"candle\\\", \\\"46\\\": \\\"a\\\", \\\"47\\\": \\\"qty\\\", \\\"48\\\": \\\"long\\\", \\\"49\\\": \\\"on\\\", \\\"50\\\": \\\"route\\\", \\\"51\\\": \\\"strategy\\\", \\\"52\\\": \\\"timestamp\\\", \\\"53\\\": \\\"spot\\\", \\\"54\\\": \\\"opening\\\", \\\"55\\\": \\\"market\\\", \\\"56\\\": \\\"mode\\\", \\\"57\\\": \\\"short\\\", \\\"58\\\": \\\"exception\\\", \\\"59\\\": \\\"value\\\", \\\"60\\\": \\\"submit\\\", \\\"61\\\": \\\"reduce\\\", \\\"62\\\": \\\"trade\\\", \\\"63\\\": \\\"trades\\\", \\\"64\\\": \\\"multiple\\\", \\\"65\\\": \\\"at\\\", \\\"66\\\": \\\"balance\\\", \\\"67\\\": \\\"average\\\", \\\"68\\\": \\\"type\\\", \\\"69\\\": \\\"be\\\", \\\"70\\\": \\\"able\\\", \\\"71\\\": \\\"current\\\", \\\"72\\\": \\\"add\\\", \\\"73\\\": \\\"close\\\", \\\"74\\\": \\\"futures\\\", \\\"75\\\": \\\"or\\\", \\\"76\\\": \\\"than\\\", \\\"77\\\": \\\"pass\\\", \\\"78\\\": \\\"exchange\\\", \\\"79\\\": \\\"isolated\\\", \\\"80\\\": \\\"method\\\", \\\"81\\\": \\\"reduced\\\", \\\"82\\\": \\\"update\\\", \\\"83\\\": \\\"new\\\", \\\"84\\\": \\\"one\\\", \\\"85\\\": \\\"routes\\\", \\\"86\\\": \\\"cancel\\\", \\\"87\\\": \\\"not\\\", \\\"88\\\": \\\"app\\\", \\\"89\\\": \\\"orderbook\\\", \\\"90\\\": \\\"list\\\", \\\"91\\\": \\\"estimate\\\", \\\"92\\\": \\\"pnl\\\", \\\"93\\\": \\\"class\\\", \\\"94\\\": \\\"side\\\", \\\"95\\\": \\\"round\\\", \\\"96\\\": \\\"equal\\\", \\\"97\\\": \\\"more\\\", \\\"98\\\": \\\"set\\\", \\\"99\\\": \\\"linearreg\\\", \\\"100\\\": \\\"store\\\", \\\"101\\\": \\\"state\\\", \\\"102\\\": \\\"without\\\", \\\"103\\\": \\\"via\\\", \\\"104\\\": \\\"before\\\", \\\"105\\\": \\\"backtesting\\\", \\\"106\\\": \\\"closing\\\", \\\"107\\\": \\\"only\\\", \\\"108\\\": \\\"np\\\", \\\"109\\\": \\\"array\\\", \\\"110\\\": \\\"completed\\\", \\\"111\\\": \\\"properties\\\", \\\"112\\\": \\\"item\\\", \\\"113\\\": \\\"available\\\", \\\"114\\\": \\\"date\\\", \\\"115\\\": \\\"dna\\\", \\\"116\\\": \\\"live\\\", \\\"117\\\": \\\"timeframe\\\", \\\"118\\\": \\\"execute\\\", \\\"119\\\": \\\"terminate\\\", \\\"120\\\": \\\"time\\\", \\\"121\\\": \\\"none\\\", \\\"122\\\": \\\"absent\\\", \\\"123\\\": \\\"ad\\\", \\\"124\\\": \\\"as\\\", \\\"125\\\": \\\"backtest\\\", \\\"126\\\": \\\"fee\\\", \\\"127\\\": \\\"portfolio\\\", \\\"128\\\": \\\"has\\\", \\\"129\\\": \\\"go\\\", \\\"130\\\": \\\"forming\\\", \\\"131\\\": \\\"positions\\\", \\\"132\\\": \\\"modifying\\\", \\\"133\\\": \\\"points\\\", \\\"134\\\": \\\"buy\\\", \\\"135\\\": \\\"sell\\\", \\\"136\\\": \\\"cannot\\\", \\\"137\\\": \\\"increase\\\", \\\"138\\\": \\\"raise\\\", \\\"139\\\": \\\"if\\\", \\\"140\\\": \\\"trying\\\", \\\"141\\\": \\\"risk\\\", \\\"142\\\": \\\"includes\\\", \\\"143\\\": \\\"generate\\\", \\\"144\\\": \\\"minutes\\\", \\\"145\\\": \\\"two\\\", \\\"146\\\": \\\"exit\\\", \\\"147\\\": \\\"too\\\", \\\"148\\\": \\\"conflicting\\\", \\\"149\\\": \\\"2\\\", \\\"150\\\": \\\"past\\\", \\\"151\\\": \\\"validation\\\", \\\"152\\\": \\\"margin\\\", \\\"153\\\": \\\"currency\\\", \\\"154\\\": \\\"arrow\\\", \\\"155\\\": \\\"asset\\\", \\\"156\\\": \\\"search\\\", \\\"157\\\": \\\"convert\\\", \\\"158\\\": \\\"symbol\\\", \\\"159\\\": \\\"percentage\\\", \\\"160\\\": \\\"format\\\", \\\"161\\\": \\\"unique\\\", \\\"162\\\": \\\"id\\\", \\\"163\\\": \\\"hash\\\", \\\"164\\\": \\\"opposite\\\", \\\"165\\\": \\\"index\\\", \\\"166\\\": \\\"trim\\\", \\\"167\\\": \\\"str\\\", \\\"168\\\": \\\"readable\\\", \\\"169\\\": \\\"string\\\", \\\"170\\\": \\\"iso8601\\\", \\\"171\\\": \\\"name\\\", \\\"172\\\": \\\"fill\\\", \\\"173\\\": \\\"middle\\\", \\\"174\\\": \\\"end\\\", \\\"175\\\": \\\"aroon\\\", \\\"176\\\": \\\"osc\\\", \\\"177\\\": \\\"bollinger\\\", \\\"178\\\": \\\"bands\\\", \\\"179\\\": \\\"high\\\", \\\"180\\\": \\\"pole\\\", \\\"181\\\": \\\"ichimoku\\\", \\\"182\\\": \\\"cloud\\\", \\\"183\\\": \\\"rsi\\\", \\\"184\\\": \\\"supersmoother\\\", \\\"185\\\": \\\"ttm\\\", \\\"186\\\": \\\"squeeze\\\", \\\"187\\\": \\\"reset\\\", \\\"188\\\": \\\"works\\\", \\\"189\\\": \\\"difference\\\", \\\"190\\\": \\\"by\\\", \\\"191\\\": \\\"total\\\", \\\"192\\\": \\\"daily\\\", \\\"193\\\": \\\"filters\\\", \\\"194\\\": \\\"same\\\", \\\"195\\\": \\\"increasing\\\", \\\"196\\\": \\\"smart\\\", \\\"197\\\": \\\"enough\\\", \\\"198\\\": \\\"part\\\", \\\"199\\\": \\\"already\\\", \\\"200\\\": \\\"increased\\\", \\\"201\\\": \\\"vars\\\", \\\"202\\\": \\\"count\\\", \\\"203\\\": \\\"leverage\\\", \\\"204\\\": \\\"liquidation\\\", \\\"205\\\": \\\"replaced\\\", \\\"206\\\": \\\"balances\\\", \\\"207\\\": \\\"less\\\", \\\"208\\\": \\\"correctly\\\", \\\"209\\\": \\\"ticker\\\", \\\"210\\\": \\\"floats\\\", \\\"211\\\": \\\"three\\\", \\\"212\\\": \\\"all\\\", \\\"213\\\": \\\"when\\\", \\\"214\\\": \\\"closed\\\", \\\"215\\\": \\\"from\\\", \\\"216\\\": \\\"bearish\\\", \\\"217\\\": \\\"bullish\\\", \\\"218\\\": \\\"split\\\", \\\"219\\\": \\\"dict\\\", \\\"220\\\": \\\"simple\\\", \\\"221\\\": \\\"exiting\\\", \\\"222\\\": \\\"handle\\\", \\\"223\\\": \\\"each\\\", \\\"224\\\": \\\"other\\\", \\\"225\\\": \\\"append\\\", \\\"226\\\": \\\"flush\\\", \\\"227\\\": \\\"last\\\", \\\"228\\\": \\\"increases\\\", \\\"229\\\": \\\"drop\\\", \\\"230\\\": \\\"negative\\\", \\\"231\\\": \\\"wallet\\\", \\\"232\\\": \\\"base\\\", \\\"233\\\": \\\"binary\\\", \\\"234\\\": \\\"clean\\\", \\\"235\\\": \\\"color\\\", \\\"236\\\": \\\"number\\\", \\\"237\\\": \\\"dashless\\\", \\\"238\\\": \\\"dashy\\\", \\\"239\\\": \\\"diff\\\", \\\"240\\\": \\\"days\\\", \\\"241\\\": \\\"hp\\\", \\\"242\\\": \\\"dump\\\", \\\"243\\\": \\\"file\\\", \\\"244\\\": \\\"exists\\\", \\\"245\\\": \\\"floor\\\", \\\"246\\\": \\\"precision\\\", \\\"247\\\": \\\"source\\\", \\\"248\\\": \\\"config\\\", \\\"249\\\": \\\"insecure\\\", \\\"250\\\": \\\"insert\\\", \\\"251\\\": \\\"debuggable\\\", \\\"252\\\": \\\"debugging\\\", \\\"253\\\": \\\"importing\\\", \\\"254\\\": \\\"livetrading\\\", \\\"255\\\": \\\"optimizing\\\", \\\"256\\\": \\\"paper\\\", \\\"257\\\": \\\"trading\\\", \\\"258\\\": \\\"unit\\\", \\\"259\\\": \\\"testing\\\", \\\"260\\\": \\\"key\\\", \\\"261\\\": \\\"max\\\", \\\"262\\\": \\\"normalize\\\", \\\"263\\\": \\\"now\\\", \\\"264\\\": \\\"ffill\\\", \\\"265\\\": \\\"shift\\\", \\\"266\\\": \\\"insertion\\\", \\\"267\\\": \\\"prepare\\\", \\\"268\\\": \\\"python\\\", \\\"269\\\": \\\"version\\\", \\\"270\\\": \\\"quote\\\", \\\"271\\\": \\\"random\\\", \\\"272\\\": \\\"duration\\\", \\\"273\\\": \\\"relative\\\", \\\"274\\\": \\\"absolute\\\", \\\"275\\\": \\\"decimals\\\", \\\"276\\\": \\\"down\\\", \\\"277\\\": \\\"secure\\\", \\\"278\\\": \\\"silently\\\", \\\"279\\\": \\\"character\\\", \\\"280\\\": \\\"style\\\", \\\"281\\\": \\\"today\\\", \\\"282\\\": \\\"merge\\\", \\\"283\\\": \\\"dicts\\\", \\\"284\\\": \\\"pid\\\", \\\"285\\\": \\\"env\\\", \\\"286\\\": \\\"float\\\", \\\"287\\\": \\\"near\\\", \\\"288\\\": \\\"almost\\\", \\\"289\\\": \\\"beginning\\\", \\\"290\\\": \\\"acosc\\\", \\\"291\\\": \\\"adosc\\\", \\\"292\\\": \\\"adx\\\", \\\"293\\\": \\\"adxr\\\", \\\"294\\\": \\\"alligator\\\", \\\"295\\\": \\\"alma\\\", \\\"296\\\": \\\"ao\\\", \\\"297\\\": \\\"apo\\\", \\\"298\\\": \\\"atr\\\", \\\"299\\\": \\\"avgprice\\\", \\\"300\\\": \\\"bandpass\\\", \\\"301\\\": \\\"beta\\\", \\\"302\\\": \\\"width\\\", \\\"303\\\": \\\"bop\\\", \\\"304\\\": \\\"cc\\\", \\\"305\\\": \\\"cci\\\", \\\"306\\\": \\\"cfo\\\", \\\"307\\\": \\\"cg\\\", \\\"308\\\": \\\"chande\\\", \\\"309\\\": \\\"chop\\\", \\\"310\\\": \\\"cksp\\\", \\\"311\\\": \\\"cmo\\\", \\\"312\\\": \\\"correl\\\", \\\"313\\\": \\\"correlation\\\", \\\"314\\\": \\\"cycle\\\", \\\"315\\\": \\\"cvi\\\", \\\"316\\\": \\\"cwma\\\", \\\"317\\\": \\\"damiani\\\", \\\"318\\\": \\\"volatmeter\\\", \\\"319\\\": \\\"dec\\\", \\\"320\\\": \\\"decycler\\\", \\\"321\\\": \\\"dema\\\", \\\"322\\\": \\\"devstop\\\", \\\"323\\\": \\\"di\\\", \\\"324\\\": \\\"dm\\\", \\\"325\\\": \\\"donchian\\\", \\\"326\\\": \\\"dpo\\\", \\\"327\\\": \\\"dti\\\", \\\"328\\\": \\\"dx\\\", \\\"329\\\": \\\"edcf\\\", \\\"330\\\": \\\"efi\\\", \\\"331\\\": \\\"ema\\\", \\\"332\\\": \\\"emd\\\", \\\"333\\\": \\\"emv\\\", \\\"334\\\": \\\"epma\\\", \\\"335\\\": \\\"er\\\", \\\"336\\\": \\\"eri\\\", \\\"337\\\": \\\"fisher\\\", \\\"338\\\": \\\"fosc\\\", \\\"339\\\": \\\"frama\\\", \\\"340\\\": \\\"fwma\\\", \\\"341\\\": \\\"gator\\\", \\\"342\\\": \\\"gauss\\\", \\\"343\\\": \\\"heikin\\\", \\\"344\\\": \\\"ashi\\\", \\\"345\\\": \\\"hma\\\", \\\"346\\\": \\\"hurst\\\", \\\"347\\\": \\\"hwma\\\", \\\"348\\\": \\\"seq\\\", \\\"349\\\": \\\"ift\\\", \\\"350\\\": \\\"itrend\\\", \\\"351\\\": \\\"jma\\\", \\\"352\\\": \\\"jsa\\\", \\\"353\\\": \\\"kama\\\", \\\"354\\\": \\\"kaufmanstop\\\", \\\"355\\\": \\\"kdj\\\", \\\"356\\\": \\\"kelner\\\", \\\"357\\\": \\\"channels\\\", \\\"358\\\": \\\"kst\\\", \\\"359\\\": \\\"kurtosis\\\", \\\"360\\\": \\\"kvo\\\", \\\"361\\\": \\\"angle\\\", \\\"362\\\": \\\"intercept\\\", \\\"363\\\": \\\"slope\\\", \\\"364\\\": \\\"lrsi\\\", \\\"365\\\": \\\"ma\\\", \\\"366\\\": \\\"maaq\\\", \\\"367\\\": \\\"mab\\\", \\\"368\\\": \\\"macd\\\", \\\"369\\\": \\\"mama\\\", \\\"370\\\": \\\"marketfi\\\", \\\"371\\\": \\\"mass\\\", \\\"372\\\": \\\"mcginley\\\", \\\"373\\\": \\\"dynamic\\\", \\\"374\\\": \\\"mean\\\", \\\"375\\\": \\\"median\\\", \\\"376\\\": \\\"medprice\\\", \\\"377\\\": \\\"mfi\\\", \\\"378\\\": \\\"midpoint\\\", \\\"379\\\": \\\"midprice\\\", \\\"380\\\": \\\"minmax\\\", \\\"381\\\": \\\"mom\\\", \\\"382\\\": \\\"mwdx\\\", \\\"383\\\": \\\"natr\\\", \\\"384\\\": \\\"nma\\\", \\\"385\\\": \\\"nvi\\\", \\\"386\\\": \\\"obv\\\", \\\"387\\\": \\\"pfe\\\", \\\"388\\\": \\\"pivot\\\", \\\"389\\\": \\\"pivot1\\\", \\\"390\\\": \\\"pivot2\\\", \\\"391\\\": \\\"pivot3\\\", \\\"392\\\": \\\"pivot4\\\", \\\"393\\\": \\\"pma\\\", \\\"394\\\": \\\"ppo\\\", \\\"395\\\": \\\"pvi\\\", \\\"396\\\": \\\"pwma\\\", \\\"397\\\": \\\"qstick\\\", \\\"398\\\": \\\"reflex\\\", \\\"399\\\": \\\"rma\\\", \\\"400\\\": \\\"roc\\\", \\\"401\\\": \\\"rocp\\\", \\\"402\\\": \\\"rocr\\\", \\\"403\\\": \\\"rocr100\\\", \\\"404\\\": \\\"roofing\\\", \\\"405\\\": \\\"rsmk\\\", \\\"406\\\": \\\"rsx\\\", \\\"407\\\": \\\"rvi\\\", \\\"408\\\": \\\"safezonestop\\\", \\\"409\\\": \\\"sar\\\", \\\"410\\\": \\\"sinwma\\\", \\\"411\\\": \\\"skew\\\", \\\"412\\\": \\\"sma\\\", \\\"413\\\": \\\"smma\\\", \\\"414\\\": \\\"sqwma\\\", \\\"415\\\": \\\"srsi\\\", \\\"416\\\": \\\"srwma\\\", \\\"417\\\": \\\"stc\\\", \\\"418\\\": \\\"stddev\\\", \\\"419\\\": \\\"stoch\\\", \\\"420\\\": \\\"stochf\\\", \\\"421\\\": \\\"3\\\", \\\"422\\\": \\\"supertrend\\\", \\\"423\\\": \\\"swma\\\", \\\"424\\\": \\\"t3\\\", \\\"425\\\": \\\"tema\\\", \\\"426\\\": \\\"trange\\\", \\\"427\\\": \\\"trendflex\\\", \\\"428\\\": \\\"trima\\\", \\\"429\\\": \\\"trix\\\", \\\"430\\\": \\\"tsf\\\", \\\"431\\\": \\\"tsi\\\", \\\"432\\\": \\\"trend\\\", \\\"433\\\": \\\"typprice\\\", \\\"434\\\": \\\"ui\\\", \\\"435\\\": \\\"ultosc\\\", \\\"436\\\": \\\"var\\\", \\\"437\\\": \\\"vi\\\", \\\"438\\\": \\\"vidya\\\", \\\"439\\\": \\\"vlma\\\", \\\"440\\\": \\\"vosc\\\", \\\"441\\\": \\\"voss\\\", \\\"442\\\": \\\"vpci\\\", \\\"443\\\": \\\"vpt\\\", \\\"444\\\": \\\"vpwma\\\", \\\"445\\\": \\\"vwap\\\", \\\"446\\\": \\\"vwma\\\", \\\"447\\\": \\\"vwmacd\\\", \\\"448\\\": \\\"wad\\\", \\\"449\\\": \\\"wclprice\\\", \\\"450\\\": \\\"wilders\\\", \\\"451\\\": \\\"willr\\\", \\\"452\\\": \\\"wma\\\", \\\"453\\\": \\\"wt\\\", \\\"454\\\": \\\"zlema\\\", \\\"455\\\": \\\"zscore\\\", \\\"456\\\": \\\"waddah\\\", \\\"457\\\": \\\"attr\\\", \\\"458\\\": \\\"explosion\\\", \\\"459\\\": \\\"stiffness\\\", \\\"460\\\": \\\"support\\\", \\\"461\\\": \\\"resistance\\\", \\\"462\\\": \\\"breaks\\\", \\\"463\\\": \\\"momentum\\\", \\\"464\\\": \\\"hull\\\", \\\"465\\\": \\\"suit\\\", \\\"466\\\": \\\"volume\\\", \\\"467\\\": \\\"properly\\\", \\\"468\\\": \\\"backfunction\\\", \\\"469\\\": \\\"accepts\\\", \\\"470\\\": \\\"1m\\\", \\\"471\\\": \\\"passed\\\", \\\"472\\\": \\\"affected\\\", \\\"473\\\": \\\"running\\\", \\\"474\\\": \\\"backtests\\\", \\\"475\\\": \\\"igcdex\\\", \\\"476\\\": \\\"pl\\\", \\\"477\\\": \\\"metrics\\\", \\\"478\\\": \\\"stores\\\", \\\"479\\\": \\\"sorted\\\", \\\"480\\\": \\\"rate\\\", \\\"481\\\": \\\"filter\\\", \\\"482\\\": \\\"liquidate\\\", \\\"483\\\": \\\"must\\\", \\\"484\\\": \\\"similar\\\", \\\"485\\\": \\\"canceled\\\", \\\"486\\\": \\\"like\\\", \\\"487\\\": \\\"example\\\", \\\"488\\\": \\\"docs\\\", \\\"489\\\": \\\"reducing\\\", \\\"490\\\": \\\"shared\\\", \\\"491\\\": \\\"taking\\\", \\\"492\\\": \\\"closes\\\", \\\"493\\\": \\\"updating\\\", \\\"494\\\": \\\"mark\\\", \\\"495\\\": \\\"log\\\", \\\"496\\\": \\\"using\\\", \\\"497\\\": \\\"low\\\", \\\"498\\\": \\\"default\\\", \\\"499\\\": \\\"hyperparameters\\\", \\\"500\\\": \\\"run\\\", \\\"501\\\": \\\"shorting\\\", \\\"502\\\": \\\"greater\\\", \\\"503\\\": \\\"zero\\\", \\\"504\\\": \\\"capital\\\", \\\"505\\\": \\\"raises\\\", \\\"506\\\": \\\"error\\\", \\\"507\\\": \\\"variables\\\", \\\"508\\\": \\\"immediately\\\", \\\"509\\\": \\\"terminate1\\\", \\\"510\\\": \\\"terminate2\\\", \\\"511\\\": \\\"chart\\\", \\\"512\\\": \\\"values\\\", \\\"513\\\": \\\"proper\\\", \\\"514\\\": \\\"handling\\\", \\\"515\\\": \\\"cancellation\\\", \\\"516\\\": \\\"data\\\", \\\"517\\\": \\\"initiating\\\", \\\"518\\\": \\\"roi\\\", \\\"519\\\": \\\"cost\\\", \\\"520\\\": \\\"spend\\\", \\\"521\\\": \\\"consider\\\", \\\"522\\\": \\\"executed\\\", \\\"523\\\": \\\"handled\\\", \\\"524\\\": \\\"cancelling\\\", \\\"525\\\": \\\"events\\\", \\\"526\\\": \\\"reduction\\\", \\\"527\\\": \\\"both\\\", \\\"528\\\": \\\"batch\\\", \\\"529\\\": \\\"including\\\", \\\"530\\\": \\\"previous\\\", \\\"531\\\": \\\"have\\\", \\\"532\\\": \\\"correct\\\", \\\"533\\\": \\\"exchanges\\\", \\\"534\\\": \\\"creating\\\", \\\"535\\\": \\\"fix\\\", \\\"536\\\": \\\"len\\\", \\\"537\\\": \\\"anchor\\\", \\\"538\\\": \\\"crossed\\\", \\\"539\\\": \\\"limit\\\", \\\"540\\\": \\\"numpy\\\", \\\"541\\\": \\\"pandas\\\", \\\"542\\\": \\\"sum\\\", \\\"543\\\": \\\"subtract\\\", \\\"544\\\": \\\"prices\\\", \\\"545\\\": \\\"returns\\\", \\\"546\\\": \\\"combinations\\\", \\\"547\\\": \\\"repeat\\\"}\", \"word_index\": \"{\\\"in\\\": 1, \\\"test\\\": 2, \\\"the\\\": 3, \\\"jesse\\\": 4, \\\"how\\\": 5, \\\"does\\\": 6, \\\"what\\\": 7, \\\"to\\\": 8, \\\"is\\\": 9, \\\"can\\\": 10, \\\"are\\\": 11, \\\"of\\\": 12, \\\"implemented\\\": 13, \\\"verify\\\": 14, \\\"you\\\": 15, \\\"explain\\\": 16, \\\"functionality\\\": 17, \\\"assertions\\\": 18, \\\"used\\\": 19, \\\"jesse's\\\": 20, \\\"suite\\\": 21, \\\"what's\\\": 22, \\\"purpose\\\": 23, \\\"show\\\": 24, \\\"me\\\": 25, \\\"position\\\": 26, \\\"orders\\\": 27, \\\"order\\\": 28, \\\"stop\\\": 29, \\\"and\\\": 30, \\\"loss\\\": 31, \\\"profit\\\": 32, \\\"with\\\": 33, \\\"price\\\": 34, \\\"after\\\": 35, \\\"property\\\": 36, \\\"take\\\": 37, \\\"get\\\": 38, \\\"should\\\": 39, \\\"entry\\\": 40, \\\"size\\\": 41, \\\"open\\\": 42, \\\"for\\\": 43, \\\"candles\\\": 44, \\\"candle\\\": 45, \\\"a\\\": 46, \\\"qty\\\": 47, \\\"long\\\": 48, \\\"on\\\": 49, \\\"route\\\": 50, \\\"strategy\\\": 51, \\\"timestamp\\\": 52, \\\"spot\\\": 53, \\\"opening\\\": 54, \\\"market\\\": 55, \\\"mode\\\": 56, \\\"short\\\": 57, \\\"exception\\\": 58, \\\"value\\\": 59, \\\"submit\\\": 60, \\\"reduce\\\": 61, \\\"trade\\\": 62, \\\"trades\\\": 63, \\\"multiple\\\": 64, \\\"at\\\": 65, \\\"balance\\\": 66, \\\"average\\\": 67, \\\"type\\\": 68, \\\"be\\\": 69, \\\"able\\\": 70, \\\"current\\\": 71, \\\"add\\\": 72, \\\"close\\\": 73, \\\"futures\\\": 74, \\\"or\\\": 75, \\\"than\\\": 76, \\\"pass\\\": 77, \\\"exchange\\\": 78, \\\"isolated\\\": 79, \\\"method\\\": 80, \\\"reduced\\\": 81, \\\"update\\\": 82, \\\"new\\\": 83, \\\"one\\\": 84, \\\"routes\\\": 85, \\\"cancel\\\": 86, \\\"not\\\": 87, \\\"app\\\": 88, \\\"orderbook\\\": 89, \\\"list\\\": 90, \\\"estimate\\\": 91, \\\"pnl\\\": 92, \\\"class\\\": 93, \\\"side\\\": 94, \\\"round\\\": 95, \\\"equal\\\": 96, \\\"more\\\": 97, \\\"set\\\": 98, \\\"linearreg\\\": 99, \\\"store\\\": 100, \\\"state\\\": 101, \\\"without\\\": 102, \\\"via\\\": 103, \\\"before\\\": 104, \\\"backtesting\\\": 105, \\\"closing\\\": 106, \\\"only\\\": 107, \\\"np\\\": 108, \\\"array\\\": 109, \\\"completed\\\": 110, \\\"properties\\\": 111, \\\"item\\\": 112, \\\"available\\\": 113, \\\"date\\\": 114, \\\"dna\\\": 115, \\\"live\\\": 116, \\\"timeframe\\\": 117, \\\"execute\\\": 118, \\\"terminate\\\": 119, \\\"time\\\": 120, \\\"none\\\": 121, \\\"absent\\\": 122, \\\"ad\\\": 123, \\\"as\\\": 124, \\\"backtest\\\": 125, \\\"fee\\\": 126, \\\"portfolio\\\": 127, \\\"has\\\": 128, \\\"go\\\": 129, \\\"forming\\\": 130, \\\"positions\\\": 131, \\\"modifying\\\": 132, \\\"points\\\": 133, \\\"buy\\\": 134, \\\"sell\\\": 135, \\\"cannot\\\": 136, \\\"increase\\\": 137, \\\"raise\\\": 138, \\\"if\\\": 139, \\\"trying\\\": 140, \\\"risk\\\": 141, \\\"includes\\\": 142, \\\"generate\\\": 143, \\\"minutes\\\": 144, \\\"two\\\": 145, \\\"exit\\\": 146, \\\"too\\\": 147, \\\"conflicting\\\": 148, \\\"2\\\": 149, \\\"past\\\": 150, \\\"validation\\\": 151, \\\"margin\\\": 152, \\\"currency\\\": 153, \\\"arrow\\\": 154, \\\"asset\\\": 155, \\\"search\\\": 156, \\\"convert\\\": 157, \\\"symbol\\\": 158, \\\"percentage\\\": 159, \\\"format\\\": 160, \\\"unique\\\": 161, \\\"id\\\": 162, \\\"hash\\\": 163, \\\"opposite\\\": 164, \\\"index\\\": 165, \\\"trim\\\": 166, \\\"str\\\": 167, \\\"readable\\\": 168, \\\"string\\\": 169, \\\"iso8601\\\": 170, \\\"name\\\": 171, \\\"fill\\\": 172, \\\"middle\\\": 173, \\\"end\\\": 174, \\\"aroon\\\": 175, \\\"osc\\\": 176, \\\"bollinger\\\": 177, \\\"bands\\\": 178, \\\"high\\\": 179, \\\"pole\\\": 180, \\\"ichimoku\\\": 181, \\\"cloud\\\": 182, \\\"rsi\\\": 183, \\\"supersmoother\\\": 184, \\\"ttm\\\": 185, \\\"squeeze\\\": 186, \\\"reset\\\": 187, \\\"works\\\": 188, \\\"difference\\\": 189, \\\"by\\\": 190, \\\"total\\\": 191, \\\"daily\\\": 192, \\\"filters\\\": 193, \\\"same\\\": 194, \\\"increasing\\\": 195, \\\"smart\\\": 196, \\\"enough\\\": 197, \\\"part\\\": 198, \\\"already\\\": 199, \\\"increased\\\": 200, \\\"vars\\\": 201, \\\"count\\\": 202, \\\"leverage\\\": 203, \\\"liquidation\\\": 204, \\\"replaced\\\": 205, \\\"balances\\\": 206, \\\"less\\\": 207, \\\"correctly\\\": 208, \\\"ticker\\\": 209, \\\"floats\\\": 210, \\\"three\\\": 211, \\\"all\\\": 212, \\\"when\\\": 213, \\\"closed\\\": 214, \\\"from\\\": 215, \\\"bearish\\\": 216, \\\"bullish\\\": 217, \\\"split\\\": 218, \\\"dict\\\": 219, \\\"simple\\\": 220, \\\"exiting\\\": 221, \\\"handle\\\": 222, \\\"each\\\": 223, \\\"other\\\": 224, \\\"append\\\": 225, \\\"flush\\\": 226, \\\"last\\\": 227, \\\"increases\\\": 228, \\\"drop\\\": 229, \\\"negative\\\": 230, 